Repository: eDeniska/iPlaylist
Catalog: iPlaylist/iPlaylist/Resources/Labels.*.resx
Languages: ru

# CurrentAlbumFormat
source: Album: {0}
ru: Альбом: {0}

# CurrentNoAlbum
source: No album
ru: Без альбома

# DefaultStatus
source: Ready
ru: Готов

# FatalErrorTitle
source: Fatal error!
ru: Ошибка!

# LanguageChangeText
source: Language change will be applied when you restart iPlaylist.
ru: Язык будет сменен после перезапуска iPlaylist.

# LanguageChangeTitle
source: Language change
ru: Смена языка

# NotifyBaloonSettings
source: iPlaylist needs you to fill application settings!
ru: Вы должны настроить iPlaylist!

# NotifyBaloonText
source: iPlaylist is now collecting your music preferences...
ru: iPlaylist изучает Ваши музыкальные предпочтения...

# PlaybackInterruptedFormat
source: Connection to media player is interrupted. {0} This could happen if you closed the media player when iPlaylist is running (which you shouldn't do). You could restart iPlaylist.
ru: Связь с медиа-плейером прервана. {0} Такое может случиться, если Вы закрыли окно плейера при запущенном iPlaylist (чего делать не следует). Вы можете перезапустить iPlaylist.

# PlaylistCompleteBaloonTextFormat
source: iPlaylist created shuffled playlist for you using information about your musical preferences
ru: iPlaylist создал перемешанный плейлист, основываясь на Ваших музыкальных предпочтениях

# PlaylistCompleteNotifyFormat
source: iPlaylist v{0} ({1}) Shuffled!
ru: iPlaylist v{0} ({1}) Перемешано!

# PlaylistCompleteStatus
source: iPlaylist created shuffled playlist for you
ru: iPlaylist создал перемешанный плейлист для Вас

# PlaylistGenerationNotifyFormat
source: iPlaylist v{0} ({1}) Shuffling...
ru: iPlaylist v{0} ({1}) Перемешиваю...

# PlaylistGenerationStatus
source: iPlaylist is generating shuffled playlist...
ru: iPlaylist создает перемешанный плейлист...

# PlaylistQualityFormat
source: {0}% (played: {1}, skipped: {2})
ru: {0}% (проиграно: {1}, пропущено: {2})

# PluginErrorFormat
source: {0} Please, report this error to developers. iPlaylist will be closed now. This error could happen if you do not have correct media player installed. In this case, select correct media player after restart.
ru: {0} Пожалуйста, сообщите об этой ошибке разработчикам. iPlaylist будет закрыт. Эта ошибка может происходить, если у Вас не установлен выбранный медиаплейер. В этом случае, выберите правильный плейер в настройках после перезапуска.

# RatingLabelFormat
source: genres: {0}, artists: {1}, albums: {2}, tracks: {3}
ru: жанров: {0}, исполнителей: {1}, альбомов: {2}, треков: {3}

# SourceDurationFormat
source: {0}.{1:00}:{2:00}:{3:00}, total tracks: {4}
ru: {0}.{1:00}:{2:00}:{3:00}, всего треков: {4}

# StatsNotifyFormat
source: iPlaylist v{0} ({1}) Rate samples: {2}
ru: iPlaylist v{0} ({1}) Данных рейтинга: {2}

# SystemLocale
source: (system language)
ru: (системный язык)

# TimeOnlineFormat
source: {0}.{1:00}:{2:00}:{3:00}, time since last shuffle: {4}.{5:00}:{6:00}:{7:00}
ru: {0}.{1:00}:{2:00}:{3:00}, после перемешивания прошло: {4}.{5:00}:{6:00}:{7:00}

# UpdateCheckStatus
source: iPlaylist is checking for updates...
ru: iPlaylist проверяет наличие обновлений...

# UpdateDownloadingStatus
source: iPlaylist is downloading update...
ru: iPlaylist скачивает обновление...

# UpdateFailedStatus
source: iPlaylist update failed!
ru: iPlaylist обновление завершилось с ошибкой!

# UpdatesNotFoundStatus
source: iPlaylist is up to date
ru: iPlaylist не требует обновлений
